In [15]:
import sys
import os
sys.path.append(os.path.dirname(os.getcwd())) 
import pandas as pd
import pyarrow as pa
import pyarrow.parquet as pq

In [16]:
table = pq.read_table('../../pipeline_model/ml_pipeline/temp_data/btc_usdt_1m.parquet')
df = table.to_pandas()

In [17]:
df.head(5)

       timestamp      open      high       low     close    volume
0  1742188260000  83459.54  83459.54  83391.76  83391.77   4.62491
1  1742188320000  83391.76  83399.26  83334.61  83339.45  41.14364
2  1742188380000  83339.45  83348.99  83221.71  83234.01  24.45911
3  1742188440000  83234.00  83305.92  83196.90  83305.59  38.44958
4  1742188500000  83305.59  83305.59  83241.51  83303.23  22.13891

In [18]:
df["timestamp"] = pd.to_datetime(df["timestamp"], unit='ms')
df.head(5)

            timestamp      open      high       low     close    volume
0 2025-03-17 05:11:00  83459.54  83459.54  83391.76  83391.77   4.62491
1 2025-03-17 05:12:00  83391.76  83399.26  83334.61  83339.45  41.14364
2 2025-03-17 05:13:00  83339.45  83348.99  83221.71  83234.01  24.45911
3 2025-03-17 05:14:00  83234.00  83305.92  83196.90  83305.59  38.44958
4 2025-03-17 05:15:00  83305.59  83305.59  83241.51  83303.23  22.13891